Repository: michep/schoosch
Catalog: lib/l10n/intl_*.arb
Languages: ru

# appTiile
source: Schoosch is school schedule app
ru: Скууш - школьный дневник

# appBarTitle
source: Schoosch
ru: Скууш

source: Save changes
ru: Сохранить изменения

source: Search
ru: Поиск

source: Name
ru: Название

source: Edit Institution
ru: Информация об учебном заведении

# weekSchedule
source: Student Classes Schedules Info
ru: Расписание уроков на неделю

# className
source: Name
ru: Название учебного класса

# classGrade
source: Grade
ru: Год обучения

# classMaster
source: Teacher
ru: Классный руководитель

# classSchedule
source: Lessons Times
ru: Расписание времени уроков

# classStudents
source: Students
ru: Учащиеяся класса

# classList
source: Classes
ru: Учебные классы

source: New Class
ru: Новый учебный класс

# dayLessontimeList
source: Lessons Times
ru: Расписания времени уроков

# curriculumName
source: Curriculum
ru: Учебный предмет

# curriculumAlternateName
source: Alias
ru: Альтернативное название

# curriculumTeacher
source: Teacher
ru: Преподаватель

# curriculumStudents
source: Students
ru: Группа учащихся

# curriculumList
source: Curriculums
ru: Учебные предметы

source: New Curriculum
ru: Новый учебный предмет

# dayScheduleList
source: Schedule
ru: Раписание занятий

# dayLessonTimeName
source: Lesson Times
ru: Раписание времени уроков

# classScheduleName
source: {classname} schedule
ru: {classname}, расписание

# venueName
source: Venue
ru: Кабинет

# venueList
source: Venues
ru: Кабинеты и помещения

# newVenue
source: New Vanue
ru: Новый кабинет

# lessonName
source: Lesson
ru: Урок

# personName
source: Name
ru: Имя

# personFirstName
source: First Name
ru: Имя

# personMiddleName
source: Middle Name
ru: Отчетсво

# personLastName
source: Last Name
ru: Фамилия

# personBirthday
source: Birthday
ru: Дата рождения

# personType
source: Type
ru: Тип

# personTypeAll
source: All
ru: Все типы

# personTypeStudent
source: Student
ru: Учащийся

# personTypeTeacher
source: Teacher
ru: Преподаватель

# personTypeParent
source: Parent
ru: Родитель

# personTypeObserver
source: Observer
ru: Наблюдатель

# personTypeAdmin
source: Admin
ru: Администратор

# personRelatedStudents
source: Related Students
ru: Связанные учащиеся

# personRelatedClasses
source: Related classes
ru: Связанные классы

# peopleList
source: Student, Teachers and other
ru: Сотрудники, учителя и ученики

# newPerson
source: New {type}
ru: Новый {type}

# scheduleFromDate
source: Schedule start date
ru: Начало действия расписания

# scheduleTillDate
source: End date
ru: Окончание действия

# scheduleLessonOrder
source: {order} lesson
ru: {order} урок'

# scheduleNoLesson
source: no lesson
ru: нет этого урока

source: Lesson
ru: Урок

# errorCurriculumEmpty
source: Curriculum should be selected
ru: Учебный предмет должен быть выбран

# errorVenueEmpty
source: Venue should be selected
ru: Кабинет должен быть выбран

# errorClassScheduleEmpty
source: Schedule should be selected
ru: Расписание должно быть выбрано

# errorClassStudentsEmpty
source: Students should be selected
ru: Нужно выбрать учащихся

# errorClassGradeEmpty
source: Grade should be provided
ru: Год обучения должен быть заполнен

# errorClassGradeNotANumber
source: Grade should be a number
ru: Год обучения должен быть числом

# errorClassGradeNotInRange
source: Grade should be between 1 and 11
ru: Год обучения должен быть между 1 и 11

# errorNameEmpty
source: Name should be provided
ru: Название должно быть заполнено

# errorTeacherEmpty
source: Teacher should be selected
ru: Преподаватель должен быть выбран

# errorStudentEmpty
source: Student should be selected
ru: Учченик должен быть выбран

# errorStudentAlreadyPresent
source: Selected Student is already in the list
ru: Выбранный учащийся уже присутствует в группе

# errorPersonIsNotATeacher
source: Selected Person is not a Teacher
ru: Выбранный персонаж не является преподавателем

# errorPersonIsNotAStudent
source: Selected Person is not a Student
ru: Выбранный персонаж не является учащимся

# errorPersonFirstNameEmpty
source: First Name should be provided
ru: Имя должно быть заполнено

# errorPersonLastNameEmpty
source: Last Name should be provided
ru: Фамилия должна быть заполнена

# errorPersonEmailEmpty
source: Email should be provided
ru: Email адрес должен быть заполнен

# errorPersonBirthdayEmpty
source: Birthdat should be provided
ru: Нужно указать дату рождения

# errorPersonParentStudentsEmpty
source: Students should be selected
ru: Нужно выбрать учащихся

# errorPersonParentClassesEmpty
source: Classes should be selected
ru: Нужно выбрать классы

# errorScheduleFromDateEmpty
source: Start Date should be provided
ru: Дата начала действия должна быть выбрана

# errorMarkError
source: Mark shoud be defined
ru: Нужно выбрать оценку

# errorHomeworkTextEmpty
source: Homework text shold not be empty
ru: Текст задания не может быть пустым

# fromTitle
source: From
ru: Время начала

# tillTitle
source: Till
ru: Время окончания

# markTitle
source: Mark
ru: Оценка

# studentTitle
source: Student
ru: Ученик

# commentTitle
source: Comment
ru: Комментарий

# setMarkTitle
source: Set Mark
ru: Поставить оценку

# updateMarkTitle
source: Update Mark
ru: Изменить оценку

# classStudentsTitle
source: Class Students
ru: Ученики класса

# currentLessonClassHomework
source: Class homework for this day
ru: Задание классу на этот урок

# currentLessonPersonalHomeworks
source: Personal homeworks for this day
ru: Персональные задания на этот урок

# currentLessonAbsences
source: Absent
ru: Отсутствующие

# currentLessonMarks
source: Marks
ru: Оценки

# nextLessonClassHomework
source: Class homework for next day
ru: Задание классу на следующий урок

# nextLessonPersonalHomeworks
source: Personal omeworks for next day
ru: Персональные задания на следующий урок

# homeworkTitle
source: Homework
ru: Домашнее задание

# homeworkTextTitle
source: Homework Text
ru: Текст задания

# classHomeworkTitle
source: Class Homework
ru: Задание всему классу

# classHomeworkCompletionsTitle
source: Homework Completions
ru: Выполнение

# errorHomeWorkExists
source: There is already a homework for this student, please select another student
ru: Задание для этого ученика уже существует, пожалуйста выберите другого ученика

# replacementsTitle
source: Schedule Replacements
ru: Подмены в расписании

# freeTeachersTitle
source: Search for Free Teachers
ru: Поиск свободных учителей

# freeLessonsTitle
source: Search for Free Lessons
ru: Поиск свободных уроков

# aboutTitle
source: About this app
ru: О приложении
